index=sysmon source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
(
    (EventCode=1 Image="*\\schtasks.exe" CommandLine="*/create*") 
    OR 
    (EventCode=11 TargetFilename="*\\Windows\\System32\\Tasks\\*")
)
| stats count min(_time) as first_seen max(_time) as last_seen values(CommandLine) as cmd values(TargetFilename) as file by Computer, User, Image
| rename Computer as "Victim Host", User as "User Context", cmd as "Command Executed"
| sort - last_seen
